---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.MechanicalSystem
source: html/fa89a368-ae2d-6f30-f208-021bfbb14dc6.htm
---
# MechanicalSystem Members

Add elements into the system and connect them with the system using given connectors.